tests/my-config.yml
execution:
- concurrency: 20
  ramp-up: 1m
  hold-for: 1m
  scenario: with_script
- distributed:
  - 169.254.23.210
  scenario: with_script

scenarios:
  with_script:
    script: Elasticsearch.jmx
    properties:
      server.rmi.ssl.disable: true
    
reporting:
#- module: final-stats
#- module: console
- module: passfail
  criteria:
  - "avg-rt>150ms for 10s, continue as failed"
  - "fail>50% for 10s, stop as failed"

settings:
  check-interval: 5s
  default-executor: jmeter
  verbose: false
  env: # set environment variables, see below for more explanation
    VARNAME1: VARVALUE1
    VARNAME2: VARVALUE2

provisioning: local

modules:
  jmeter:
    path: ~/.bzt/jmeter-taurus/bin/jmeter
    download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-{version}.zip
    version: 5.2.1  # minimal supported version of JMeter is 2.9
    force-ctg: true   # true by default
    detect-plugins: false
    plugins:
    - jpgc-json=2.2
    - jmeter-ftp
    - jpgc-casutg